gpu/rapidcfd/cases/uvg06v3_p070_b12_to_a18/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


wing.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // 150 deg keeps the blunt TE corners and vane plate edges while
        // ignoring the gentle skin curvature.
        includedAngle   150;
    }

    writeObj            no;
}
